<?php
//      Числа
// преф
$num1 = 10;
echo ++$num1 . ' - префиксный' . "<br>";
// пост
$num2 = -25;
$num2++;
echo $num2 . ' - постфиксный' . "<hr>";
// преф
$num3 = 109;
echo ++$num3 . ' - префиксный' . "<br>";
// пост
$num4 = 20.46;
$num4--;
echo $num4 . ' - постфиксный' . "<hr>";

//      Строки
// преф
$str1 = 'abc';
echo ++$str1 . ' - префиксный' . "<br>";
$str2 = 'fgj';
$str2++;
echo $str2 . ' - постфиксный' . "<hr>";
$str3 = 'zzz';
echo ++$str3 . ' - префиксный' . "<br>";
$str4 = 'b';
$str4++;
echo $str4 . ' - постфиксный' . "<br>";